ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV227/ESP32_WordClockV227.ino
//--------------------------------------------                                  //
// BLE TimeReceiver client callbacks
// onDisconnect ONLY sets flags. All teardown is deferred to loop context.
//--------------------------------------------
class TimeReceiverClientCB : public NimBLEClientCallbacks
{
 void onConnect(NimBLEClient* client) override
   {
    TRConnected      = true;
    TRConnecting     = false;
    TRConnectedSince = millis();
    Tekstprintlnf("TimeReceiver connected to: %s", TIMESENDER_DEVICE_NAME);
   }

 void onDisconnect(NimBLEClient* client, int reason) override
   {
    Tekstprintlnf("TimeReceiver disconnected (reason: %d)", reason);
    TRConnected         = false;
    TRConnecting        = false;
    TRhaveFoundAddr     = false;
    TRconnectRequested  = false;
    TimeReceiverRunning = false;
    pRemoteTX           = nullptr;                                              // Just null our cached pointers - safe in callback
    pRemoteRX           = nullptr;
    TRneedsCleanup      = true;                                                 // Defer deleteClient + rescan to loop context
   }
};

//--------------------------------------------                                  //
// BLE TimeReceiver scan callbacks
//--------------------------------------------
class TimeReceiverScanCB : public NimBLEScanCallbacks
{
 void onResult(const NimBLEAdvertisedDevice* dev) override
   {
    if (TRConnecting) return;
    if (!dev->haveName()) return;
    if (dev->getName().find(TIMESENDER_DEVICE_NAME) == std::string::npos) return;
    if (dev->getRSSI() <= TIMERECEIVER_MIN_RSSI) return;
    if (!dev->isConnectable()) return;
    if (!dev->isAdvertisingService(NimBLEUUID(SERVICE_UUID))) return;
    TRfoundAddr        = dev->getAddress();
    TRhaveFoundAddr    = true;
    TRconnectRequested = true;
    NimBLEDevice::getScan()->stop();
   }
};

//--------------------------------------------                                  //
// Single STATIC callback instances - defined AFTER the classes so the
// compiler can size them. Passed to NimBLE with `false` => never freed.
//--------------------------------------------
static TimeReceiverClientCB trClientCB;
static TimeReceiverScanCB   trScanCB;

//--------------------------------------------                                  //
// BLE TimeReceiver Send message to peer (writes to remote RX characteristic)
//--------------------------------------------
void SendMessageTimeReceiver(const char* msg)
{
 if (!TRConnected || !msg || !pRemoteRX || !pClient) return;
 if (!pClient->isConnected()) { TRConnected = false; return; }
 size_t len = strlen(msg);
 pRemoteRX->writeValue((uint8_t*)msg, len, false);
}

//--------------------------------------------                                  //
// BLE TimeReceiver Start scan (uses STATIC scan callback - no `new`)
//--------------------------------------------
void StartTimeReceiverScan(void)
{
 NimBLEScan* scan = NimBLEDevice::getScan();
 if (TimeReceiverRunning && !scan->isScanning())                                // Flag stale - scan isn't actually running
   {
    TimeReceiverRunning = false;
    Tekstprintln("Flag reset - scan not running");
   }
 if (TimeReceiverRunning) { Tekstprintln("Scan already running - skipping"); return; }
 if (scan->isScanning())  { scan->stop(); delay(100); }
 TimeReceiverRunning = true;
 scan->setActiveScan(true);
 scan->setInterval(160);
 scan->setWindow(30);
 scan->setScanCallbacks(&trScanCB, false);                                      // Static instance, do NOT delete
 if (!scan->start(0, false, false))
   {
    Tekstprintln("ERROR: Failed to start TimeReceiver scan");
    TimeReceiverRunning = false;
   }
 else
   {
    LastTimeReceiverScan = millis();
    Tekstprintln("TimeReceiver scan started");
   }
}

//--------------------------------------------                                  //
// BLE TimeReceiver Stop (loop context only)
//--------------------------------------------
void StopTimeReceiver(void)
{
 NimBLEDevice::getScan()->stop();
 if (pClient)
   {
    if (pClient->isConnected()) pClient->disconnect();
    NimBLEDevice::deleteClient(pClient);                                        // Loop context => safe
    pClient = nullptr;
   }
 TRConnected        = false;
 TRConnecting       = false;
 pRemoteTX          = nullptr;
 pRemoteRX          = nullptr;
 TRhaveFoundAddr    = false;
 TRconnectRequested = false;
 TRneedsCleanup     = false;
}

//--------------------------------------------                                  //
// BLE TimeReceiver Connect (loop context only - all deleteClient here is safe)
//--------------------------------------------
static void Connect_TimeReceiver(void)
{
 if (!TRhaveFoundAddr || TRConnected || TRConnecting) return;
 const int           MAX_CONNECT_ATTEMPTS    = 3;
 const unsigned long POST_DISCONNECT_DELAY_MS = 150;

 for (int attempt = 1; attempt <= MAX_CONNECT_ATTEMPTS; ++attempt)
    {
     NimBLEDevice::getScan()->stop();
     delay(100);
     pClient = NimBLEDevice::createClient();
     pClient->setClientCallbacks(&trClientCB, false);                           // Static instance, do NOT delete
     TRConnecting     = true;
     TRconnectStartms = millis();

     if (!pClient->connect(TRfoundAddr))
        {
         NimBLEDevice::deleteClient(pClient); pClient = nullptr;
         TRConnecting = false; delay(POST_DISCONNECT_DELAY_MS); continue;
        }
     NimBLERemoteService* svc = pClient->getService(SERVICE_UUID);
     if (!svc)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient); pClient = nullptr;
         TRConnecting = false; delay(POST_DISCONNECT_DELAY_MS); continue;
        }
     pRemoteTX = svc->getCharacteristic(CHARACTERISTIC_UUID_TX);
     pRemoteRX = svc->getCharacteristic(CHARACTERISTIC_UUID_RX);
     if (!pRemoteTX || !pRemoteRX)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient); pClient = nullptr;
         TRConnecting = false; delay(POST_DISCONNECT_DELAY_MS); continue;
        }
     if (!pRemoteTX->subscribe(true, TimeReceiverNotifyCB, true))
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient); pClient = nullptr;
         TRConnecting = false; delay(POST_DISCONNECT_DELAY_MS); continue;
        }
     TRConnectedSince   = millis();
     TRhaveFoundAddr    = false;
     TRconnectRequested = false;
     TRConnecting       = false;
     return;                                                                    // Connected; onConnect callback sets TRConnected
    }

